<?php

namespace Database\Seeders;

use App\Models\Law;
use App\Models\Page;
use App\Models\Partner;
use App\Models\Director;
use App\Models\Outreach;
use App\Models\Paragraph;
use App\Models\Initiative;
use Illuminate\Database\Seeder;

class PageTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $pages = [
            [
                'type'  => 1,
                'photo' => 'bg-header-page.png',
                'en' => [
                    'name'              => 'Incorporation',
                    'meta_title'        => 'Incorporation',
                    'meta_description'  => 'Incorporation',
                    'meta_keywords'     => 'Incorporation',
                    'name'              => 'Incorporation',
                    'slug'              => 'Incorporation',
                    'title'             => 'Incorporation',
                    'brief'             => 'Incorporation',
                    'description' => 'تأسست جمعية حماية المستثمرين الأفراد في عام 2020م، بموافقة وزارة الموارد البشرية والتنمية الاجتماعية. ويتميز أعضاؤها المؤسسين بالخبرة والمعرفة القانونية والمالية. تعتبر أول جمعية تعنى بحماية المستثمرين الأفراد في السوق المالية السعودية. انطلاقاً من برنامج “تطوير القطاع المالي” أحد البرامج التنفيذية لتحقيق رؤية المملكة 2030، وضمن الخطة الاستراتيجية لهيئة السوق المالية السعودية 2021-2023، ستقدم الجمعية الحماية للمستثمرين الأفراد في السوق المالية السعودية في عدة جوانب أهمها الجانب التوعوي والقانوني',
                ],
                'ar' => [
                    'name'              => 'التآسيس',
                    'meta_title'        => 'التآسيس',
                    'meta_description'  => 'التآسيس',
                    'meta_keywords'     => 'التآسيس',
                    'name'              => 'التآسيس',
                    'slug'              => 'التآسيس',
                    'title'             => 'التآسيس',
                    'brief'             => 'التآسيس',
                    'description' => 'تأسست جمعية حماية المستثمرين الأفراد في عام 2020م، بموافقة وزارة الموارد البشرية والتنمية الاجتماعية. ويتميز أعضاؤها المؤسسين بالخبرة والمعرفة القانونية والمالية. تعتبر أول جمعية تعنى بحماية المستثمرين الأفراد في السوق المالية السعودية. انطلاقاً من برنامج “تطوير القطاع المالي” أحد البرامج التنفيذية لتحقيق رؤية المملكة 2030، وضمن الخطة الاستراتيجية لهيئة السوق المالية السعودية 2021-2023، ستقدم الجمعية الحماية للمستثمرين الأفراد في السوق المالية السعودية في عدة جوانب أهمها الجانب التوعوي والقانوني',
                ],
            ],
            [
                'type'  => 1,
                'photo' => 'bg-header-page.png',
                'en' => [
                    'name'              => 'Our Goals',
                    'meta_title'        => 'Our Goals',
                    'meta_description'  => 'Our Goals',
                    'meta_keywords'     => 'Our Goals',
                    'name'              => 'Our Goals',
                    'slug'              => 'our-goals',
                    'title'             => 'Our Goals',
                    'brief'             => 'Our Goals',
                    'description' => 'وفق استراتيجية الأعمال لجمعية حماية المستثمرين الأفراد تم التركيز على هدفين استراتيجيين، تُبنى على أساسه كل الأهداف الفرعية والتشغيلية: أولاً : تمكين المستثمرين الأفراد معرفياً ودعمهم بالاستشارات القانونية لرفع مستوى وعيهم بالسوق المالية وأنظمته وقوانينه وحقوقهم وواجباتهم بما يساهم في رفع قدراتهم ومهارتهم في التداول والتعاملات المختلفة المرتبطة بالسوق المالية السعودية. ثانياً: المساهمة في تطوير السوق المالية السعودية لسوق متقدمة من خلال التكامل مع الجهات الحكومية لرفع شفافية السوق وتعزيز موثوقيتها وتحقيق مستهدفات برنامج تطوير القطاع المالي من خلال تحفيز مفاهيم الادخار والتمويل والاستثمار.',
                ],
                'ar' => [
                    'name'              => 'اهداف الجمعية',
                    'meta_title'        => 'اهداف الجمعية',
                    'meta_description'  => 'اهداف الجمعية',
                    'meta_keywords'     => 'اهداف الجمعية',
                    'name'              => 'اهداف الجمعية',
                    'slug'              => 'اهداف-الجمعية',
                    'title'             => 'اهداف الجمعية',
                    'brief'             => 'اهداف الجمعية',
                    'description' => 'وفق استراتيجية الأعمال لجمعية حماية المستثمرين الأفراد تم التركيز على هدفين استراتيجيين، تُبنى على أساسه كل الأهداف الفرعية والتشغيلية: أولاً : تمكين المستثمرين الأفراد معرفياً ودعمهم بالاستشارات القانونية لرفع مستوى وعيهم بالسوق المالية وأنظمته وقوانينه وحقوقهم وواجباتهم بما يساهم في رفع قدراتهم ومهارتهم في التداول والتعاملات المختلفة المرتبطة بالسوق المالية السعودية. ثانياً: المساهمة في تطوير السوق المالية السعودية لسوق متقدمة من خلال التكامل مع الجهات الحكومية لرفع شفافية السوق وتعزيز موثوقيتها وتحقيق مستهدفات برنامج تطوير القطاع المالي من خلال تحفيز مفاهيم الادخار والتمويل والاستثمار.',
                ],
            ],
            [
                'type'  => 1,
                'photo' => 'bg-header-page.png',
                'image' => 'organizational-structure.png',
                'en' => [
                    'name'              => 'Organizational Structure',
                    'meta_title'        => 'Organizational Structure',
                    'meta_description'  => 'Organizational Structure',
                    'meta_keywords'     => 'Organizational Structure',
                    'name'              => 'Organizational Structure',
                    'slug'              => 'organizational-structure',
                    'title'             => 'Organizational Structure',
                    'brief'             => 'Organizational Structure',
                    'description' => '<img src="http://localhost/uploads/images/original/organize-structure.png" alt="Organizational Structure" />',

                ],
                'ar' => [
                    'name'              => 'الهيكل التنظيمي',
                    'meta_title'        => 'الهيكل التنظيمي',
                    'meta_description'  => 'الهيكل التنظيمي',
                    'meta_keywords'     => 'الهيكل التنظيمي',
                    'name'              => 'الهيكل التنظيمي',
                    'slug'              => 'الهيكل التنظيمي',
                    'title'             => 'الهيكل التنظيمي',
                    'brief'             => 'الهيكل التنظيمي',
                    'description' => '<img src="http://localhost/uploads/images/original/organize-structure.png" alt="Organizational Structure" />',


                ],
            ],
            [
                'type'  => 1,
                'photo' => 'bg-header-page.png',
                'en' => [
                    'name'              => 'How to file a class action',
                    'meta_title'        => 'How to file a class action',
                    'meta_description'  => 'How to file a class action',
                    'meta_keywords'     => 'How to file a class action',
                    'name'              => 'How to file a class action',
                    'slug'              => 'How-to-file-a-class-action',
                    'title'             => 'How to file a class action',
                    'brief'             => 'How to file a class action',
                    'description' => 'تأسست جمعية حماية المستثمرين الأفراد في عام 2020م، بموافقة وزارة الموارد البشرية والتنمية الاجتماعية. ويتميز أعضاؤها المؤسسين بالخبرة والمعرفة القانونية والمالية. تعتبر أول جمعية تعنى بحماية المستثمرين الأفراد في السوق المالية السعودية. انطلاقاً من برنامج “تطوير القطاع المالي” أحد البرامج التنفيذية لتحقيق رؤية المملكة 2030، وضمن الخطة الاستراتيجية لهيئة السوق المالية السعودية 2021-2023، ستقدم الجمعية الحماية للمستثمرين الأفراد في السوق المالية السعودية في عدة جوانب أهمها الجانب التوعوي والقانوني',
                ],
                'ar' => [
                    'name'              => 'شرح كيفية تقديم دعوة جماعية',
                    'meta_title'        => 'شرح كيفية تقديم دعوة جماعية',
                    'meta_description'  => 'شرح كيفية تقديم دعوة جماعية',
                    'meta_keywords'     => 'شرح كيفية تقديم دعوة جماعية',
                    'name'              => 'شرح كيفية تقديم دعوة جماعية',
                    'slug'              => 'شرح كيفية تقديم دعوة جماعية',
                    'title'             => 'شرح كيفية تقديم دعوة جماعية',
                    'brief'             => 'شرح كيفية تقديم دعوة جماعية',
                    'description' => 'تأسست جمعية حماية المستثمرين الأفراد في عام 2020م، بموافقة وزارة الموارد البشرية والتنمية الاجتماعية. ويتميز أعضاؤها المؤسسين بالخبرة والمعرفة القانونية والمالية. تعتبر أول جمعية تعنى بحماية المستثمرين الأفراد في السوق المالية السعودية. انطلاقاً من برنامج “تطوير القطاع المالي” أحد البرامج التنفيذية لتحقيق رؤية المملكة 2030، وضمن الخطة الاستراتيجية لهيئة السوق المالية السعودية 2021-2023، ستقدم الجمعية الحماية للمستثمرين الأفراد في السوق المالية السعودية في عدة جوانب أهمها الجانب التوعوي والقانوني',
                ],
            ],

        ];

        $paragraphs = [
            // Incorporation
            [
                'page_id' => 1,
                'en' => [
                    'title' => 'التأسيس',
                    'text' => 'تأسست جمعية حماية المستثمرين الأفراد في عام 2020م، بموافقة وزارة الموارد البشرية والتنمية الاجتماعية. ويتميز أعضاؤها المؤسسين بالخبرة والمعرفة القانونية والمالية.'
                ],
                'ar' => [
                    'title' => 'التأسيس',
                    'text' => 'تأسست جمعية حماية المستثمرين الأفراد في عام 2020م، بموافقة وزارة الموارد البشرية والتنمية الاجتماعية. ويتميز أعضاؤها المؤسسين بالخبرة والمعرفة القانونية والمالية.'
                ],
            ],
            [
                'page_id' => 1,
                'en' => [
                    'title' => 'غرضها',
                    'text' => 'تعتبر أول جمعية تعنى بحماية المستثمرين الأفراد في السوق المالية السعودية.'
                ],
                'ar' => [
                    'title' => 'غرضها',
                    'text' => 'تعتبر أول جمعية تعنى بحماية المستثمرين الأفراد في السوق المالية السعودية.'
                ],
            ],
            [
                'page_id' => 1,
                'en' => [
                    'title' => 'منطلقات تأسيسها',
                    'text' => 'انطلاقاً من برنامج “تطوير القطاع المالي” أحد البرامج التنفيذية لتحقيق رؤية المملكة 2030، وضمن الخطة الاستراتيجية لهيئة السوق المالية السعودية 2021-2023، ستقدم الجمعية الحماية للمستثمرين الأفراد في السوق المالية السعودية في عدة جوانب أهمها الجانب التوعوي والقانوني.'
                ],
                'ar' => [
                    'title' => 'منطلقات تأسيسها',
                    'text' => 'انطلاقاً من برنامج “تطوير القطاع المالي” أحد البرامج التنفيذية لتحقيق رؤية المملكة 2030، وضمن الخطة الاستراتيجية لهيئة السوق المالية السعودية 2021-2023، ستقدم الجمعية الحماية للمستثمرين الأفراد في السوق المالية السعودية في عدة جوانب أهمها الجانب التوعوي والقانوني.'
                ],
            ],
            [
                'page_id' => 1,
                'en' => [
                    'title' => 'الصفة الاعتبارية',
                    'text' => 'كيان مُستقل مُرخص وغير ربحي مدعوم من الجهات التشريعية.'
                ],
                'ar' => [
                    'title' => 'الصفة الاعتبارية',
                    'text' => 'كيان مُستقل مُرخص وغير ربحي مدعوم من الجهات التشريعية.'
                ],
            ],
            [
                'page_id' => 1,
                'en' => [
                    'title' => 'الرؤية',
                    'text' => 'رفع مستوى وعي المستثمرين الأفراد بما يساهم في تعزيز أداء السوق المالية السعودية.'
                ],
                'ar' => [
                    'title' => 'الرؤية',
                    'text' => 'رفع مستوى وعي المستثمرين الأفراد بما يساهم في تعزيز أداء السوق المالية السعودية.'
                ],
            ],
            [
                'page_id' => 1,
                'en' => [
                    'title' => 'الرسالة',
                    'text' => 'رفع ثقة المستثمرين الأفراد وتعظيم منفعة تداولاتهم من خلال تقديم الدعم و الاستشارات القانونية ورفع وعي المستثمر الفرد بكافة حقوقه والتزاماته في تعاملات السوق المالية.'
                ],
                'ar' => [
                    'title' => 'الرسالة',
                    'text' => 'رفع ثقة المستثمرين الأفراد وتعظيم منفعة تداولاتهم من خلال تقديم الدعم و الاستشارات القانونية ورفع وعي المستثمر الفرد بكافة حقوقه والتزاماته في تعاملات السوق المالية.'
                ],
            ],


            // Our Goals
            [
                'page_id' => 2,
                'en' => [
                    'title' => 'أهداف الجمعية',
                    'text' => '<p>وفق استراتيجية الأعمال لجمعية حماية المستثمرين الأفراد تم التركيز على هدفين استراتيجيين، تُبنى على أساسه كل الأهداف الفرعية والتشغيلية:</p>

<p><strong>أولاً :</strong> تمكين المستثمرين الأفراد معرفياً ودعمهم بالاستشارات القانونية لرفع مستوى وعيهم بالسوق المالية وأنظمته وقوانينه وحقوقهم وواجباتهم بما يساهم في رفع قدراتهم ومهارتهم في التداول والتعاملات المختلفة المرتبطة بالسوق المالية السعودية.</p>

<p><strong>ثانياً:</strong> المساهمة في تطوير السوق المالية السعودية لسوق متقدمة من خلال التكامل مع الجهات الحكومية لرفع شفافية السوق وتعزيز موثوقيتها وتحقيق مستهدفات برنامج تطوير القطاع المالي من خلال تحفيز مفاهيم الادخار والتمويل والاستثمار.</p>
'
                ],
                'ar' => [
                    'title' => 'أهداف الجمعية',
                    'text' => '<p>وفق استراتيجية الأعمال لجمعية حماية المستثمرين الأفراد تم التركيز على هدفين استراتيجيين، تُبنى على أساسه كل الأهداف الفرعية والتشغيلية:</p>

<p><strong>أولاً :</strong> تمكين المستثمرين الأفراد معرفياً ودعمهم بالاستشارات القانونية لرفع مستوى وعيهم بالسوق المالية وأنظمته وقوانينه وحقوقهم وواجباتهم بما يساهم في رفع قدراتهم ومهارتهم في التداول والتعاملات المختلفة المرتبطة بالسوق المالية السعودية.</p>

<p><strong>ثانياً:</strong> المساهمة في تطوير السوق المالية السعودية لسوق متقدمة من خلال التكامل مع الجهات الحكومية لرفع شفافية السوق وتعزيز موثوقيتها وتحقيق مستهدفات برنامج تطوير القطاع المالي من خلال تحفيز مفاهيم الادخار والتمويل والاستثمار.</p>
'
                ],
            ],
            [
                'page_id' => 2,
                'en' => [
                    'title' => 'دور الجمعية',
                    'text' => '<p>1- رفع الوعي المالي والقانوني للمستثمرين الأفراد وتطوير المستوى المعرفي لهم.</p>

<p>2- تقديم المشورة والمساعدة القانونية للأعضاء والمستثمرين الافراد.</p>

<p>3- التعاون مع الجهات الرقابية لدعم قضايا المستثمرين الأفراد المتضررين والمساهمة في حمايتهم</p>

<p>4- التكامل مع الجهات الرقابية لفهم وتحليل أداء الشركات المدرجة والمؤسسات المالية.</p>

<p>5- تحليل وتقييم الأنظمة واللوائح السياسات والتشريعات المؤثرة على المستثمرين الأفراد وتقديم المقترحات والتوصيات اللازمة لهم.</p>
'
                ],
                'ar' => [
                    'title' => 'دور الجمعية',
                    'text' => '<p>1- رفع الوعي المالي والقانوني للمستثمرين الأفراد وتطوير المستوى المعرفي لهم.</p>

<p>2- تقديم المشورة والمساعدة القانونية للأعضاء والمستثمرين الافراد.</p>

<p>3- التعاون مع الجهات الرقابية لدعم قضايا المستثمرين الأفراد المتضررين والمساهمة في حمايتهم</p>

<p>4- التكامل مع الجهات الرقابية لفهم وتحليل أداء الشركات المدرجة والمؤسسات المالية.</p>

<p>5- تحليل وتقييم الأنظمة واللوائح السياسات والتشريعات المؤثرة على المستثمرين الأفراد وتقديم المقترحات والتوصيات اللازمة لهم.</p>
'
                ],
            ],

            // How to file a class action
            [
                'page_id' => 4,
                'en' => [
                    'title' => 'طلب الانضمام لدعوى جماعية',
                    'text' => '<p>في إطار سعي هيئة السوق المالية &ldquo;الهيئة&rdquo; المستمر إلى تطوير السوق المالية في المملكة وحماية المستثمرين فيها، وتعزيز آليات تعويض المستثمرين وتيسير إجراءات التقاضي للمتعاملين في السوق المالية بما يكفل حصول المتضررين على تعويضاتهم بأسرع وقت وبأيسر آلية ممكنة، وبناء على نظام السوق المالية الصادر بالمرسوم الملكي رقم (م/30) وتاريخ 1424/2/6هـ، أصدر مجلس الهيئة قراره المتضمن اعتماد تعديل لائحة إجراءات الفصل في منازعات الأوراق المالية &ldquo;اللائحة&rdquo;، وذلك بإضافة باب تنظيم الدعوى الجماعية الذي تم نشره على موقعها الإلكتروني.</p>

<p>ويهدف تنظيم الدعوى الجماعية ضمن&nbsp;اللائحة&nbsp;إلى تيسير إجراءات التقاضي في الدعاوى التي يكون المدعي فيها مجموعة كبيرة من الأشخاص يشتركون جميعاً في ذات المسائل النظامية والوقائع المدعى بها، وهو الأمر الذي يتناسب مع طبيعة شركات المساهمة المدرجة وحجم المساهمين فيها. كما أن هذا التعديل يرمي إلى تطوير آليات التقاضي وإجراءاته بما ينسجم مع أفضل الممارسات الدولية، وبما يعزز من جاذبية السوق المالية السعودية ويقلل من مخاطر الاستثمار فيها، بالإضافة إلى دوره في تقليص المدد الزمنية اللازمة للبت في قضايا تعويض المستثمرين بما ييسر عمل اللجان من جهة ويركز جهود المستثمرين من جهة أخرى.</p>

<p>&nbsp;</p>

<p>ويمكن الاطلاع على اللائحة المعدلة على موقع الهيئة من خلال:</p>

<p><a href="https://cma.org.sa/RulesRegulations/Regulations/Documents/RSDPR_ar.pdf">لائحة إجراءات الفصل في منازعات الأوراق المالية&nbsp;</a></p>

<p><br />
كما يمكن الاطلاع على&nbsp;العرض التقديمي الخاص&nbsp;بالدعوى الجماعية من خلال:</p>

<p><a href="https://cma.org.sa/Awareness/Publications/DocLib1/Presentation1.pdf" rel="noopener" target="_blank">العرض التقديمي للدعوى الجماعية</a></p>
'
                ],
                'ar' => [
                    'title' => 'طلب الانضمام لدعوى جماعية',
                    'text' => '<p>في إطار سعي هيئة السوق المالية &ldquo;الهيئة&rdquo; المستمر إلى تطوير السوق المالية في المملكة وحماية المستثمرين فيها، وتعزيز آليات تعويض المستثمرين وتيسير إجراءات التقاضي للمتعاملين في السوق المالية بما يكفل حصول المتضررين على تعويضاتهم بأسرع وقت وبأيسر آلية ممكنة، وبناء على نظام السوق المالية الصادر بالمرسوم الملكي رقم (م/30) وتاريخ 1424/2/6هـ، أصدر مجلس الهيئة قراره المتضمن اعتماد تعديل لائحة إجراءات الفصل في منازعات الأوراق المالية &ldquo;اللائحة&rdquo;، وذلك بإضافة باب تنظيم الدعوى الجماعية الذي تم نشره على موقعها الإلكتروني.</p>

<p>ويهدف تنظيم الدعوى الجماعية ضمن&nbsp;اللائحة&nbsp;إلى تيسير إجراءات التقاضي في الدعاوى التي يكون المدعي فيها مجموعة كبيرة من الأشخاص يشتركون جميعاً في ذات المسائل النظامية والوقائع المدعى بها، وهو الأمر الذي يتناسب مع طبيعة شركات المساهمة المدرجة وحجم المساهمين فيها. كما أن هذا التعديل يرمي إلى تطوير آليات التقاضي وإجراءاته بما ينسجم مع أفضل الممارسات الدولية، وبما يعزز من جاذبية السوق المالية السعودية ويقلل من مخاطر الاستثمار فيها، بالإضافة إلى دوره في تقليص المدد الزمنية اللازمة للبت في قضايا تعويض المستثمرين بما ييسر عمل اللجان من جهة ويركز جهود المستثمرين من جهة أخرى.</p>

<p>&nbsp;</p>

<p>ويمكن الاطلاع على اللائحة المعدلة على موقع الهيئة من خلال:</p>

<p><a href="https://cma.org.sa/RulesRegulations/Regulations/Documents/RSDPR_ar.pdf">لائحة إجراءات الفصل في منازعات الأوراق المالية&nbsp;</a></p>

<p><br />
كما يمكن الاطلاع على&nbsp;العرض التقديمي الخاص&nbsp;بالدعوى الجماعية من خلال:</p>

<p><a href="https://cma.org.sa/Awareness/Publications/DocLib1/Presentation1.pdf" rel="noopener" target="_blank">العرض التقديمي للدعوى الجماعية</a></p>
'
                ],
            ],
            [
                'page_id' => 4,
                'en' => [
                    'title' => 'تقديم طلب انضمام لدعوى جماعية',
                    'text' => 'تستقبل هيئة السوق المالية طلبات الانضمام لدعوى جماعية التي تقع في نطاق أحكام نظام السوق المالية ولوائحه التنفيذية، والنظر فيها ودراستها والتحقق من صحتها، وإحالتها إلى اللجنة.'
                ],
                'ar' => [
                    'title' => 'تقديم طلب انضمام لدعوى جماعية',
                    'text' => 'تستقبل هيئة السوق المالية طلبات الانضمام لدعوى جماعية التي تقع في نطاق أحكام نظام السوق المالية ولوائحه التنفيذية، والنظر فيها ودراستها والتحقق من صحتها، وإحالتها إلى اللجنة.'
                ],
            ],
            [
                'page_id' => 4,
                'en' => [
                    'title' => 'كيف يتم  تقديم طلب انضمام لدعوى جماعية إلى الهيئة',
                    'text' => '<ul>
                    <li>
                    <p>من خلال موقع الهيئة الإلكتروني.</p>
                    </li>
                    <li>
                    <p>مقر هيئة السوق المالية طريق الملك فهد الدور الأرضي، مكتب حماية المستثمر.</p>
                    </li>
                </ul>
                '
                ],
                'ar' => [
                    'title' => 'كيف يتم  تقديم طلب انضمام لدعوى جماعية إلى الهيئة',
                    'text' => '<ul>
                    <li>
                    <p>من خلال موقع الهيئة الإلكتروني.</p>
                    </li>
                    <li>
                    <p>مقر هيئة السوق المالية طريق الملك فهد الدور الأرضي، مكتب حماية المستثمر.</p>
                    </li>
                </ul>
                '
                ],
            ],
            [
                'page_id' => 4,
                'en' => [
                    'title' => 'المستندات الواجب إرفاقها مع طلب الانضمام لدعوى جماعية',
                    'text' => '<ul>
	<li>للأفراد صورة من بطاقة الهوية الوطنية للسعوديين ومواطني دول الخليج العربي، أو صورة من هوية مقيم لغير السعوديين، أو صورة من جواز السفر للمقيمين خارج المملكة، بالنسبة للمؤسسات والشركات صورة من السجل التجاري وأن تكون الشكوى موقعة من الشخص المفوض، (لن ينظر أو تستكمل إجراءات معالجة طلب الانضمام في حالة عدم إرفاقها).</li>
	<li>صورة من الوكالة الشرعية والهوية الوطنية للوكيل الشرعي.</li>
	<li>صورة من المستندات المؤيدة لطلب الانضمام.&nbsp;</li>
</ul>
'
                ],
                'ar' => [
                    'title' => 'المستندات الواجب إرفاقها مع طلب الانضمام لدعوى جماعية',
                    'text' => '<ul>
	<li>للأفراد صورة من بطاقة الهوية الوطنية للسعوديين ومواطني دول الخليج العربي، أو صورة من هوية مقيم لغير السعوديين، أو صورة من جواز السفر للمقيمين خارج المملكة، بالنسبة للمؤسسات والشركات صورة من السجل التجاري وأن تكون الشكوى موقعة من الشخص المفوض، (لن ينظر أو تستكمل إجراءات معالجة طلب الانضمام في حالة عدم إرفاقها).</li>
	<li>صورة من الوكالة الشرعية والهوية الوطنية للوكيل الشرعي.</li>
	<li>صورة من المستندات المؤيدة لطلب الانضمام.&nbsp;</li>
</ul>
'
                ],
            ],


        ];



        $partners = [
            ['logo' => 'company-1.png', 'link' => '#'],
            ['logo' => 'company-2.png', 'link' => '#'],
            ['logo' => 'company-3.png', 'link' => '#'],
        ];

        $outreachs = [
            [
                'en' => [
                    'meta_title' => 'Lorem ipsum dolor sit amet.',
                    'meta_description' => 'Lorem ipsum dolor sit amet.',
                    'meta_keywords' => 'Lorem ipsum dolor sit amet.',
                    'name' => 'Lorem ipsum dolor sit amet.',
                    'title' => 'Lorem ipsum dolor sit',
                    'brief' => 'Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet.',
                    'description' => '<p>تستقبل هيئة السوق المالية الشكاوى التي تقع في نطاق أحكام نظام السوق المالية ولوائحه التنفيذية، والنظر فيها ودراستها والتحقق من صحتها، والعمل على تسوية المنازعات التي تنشأ بين الأطراف المشاركة فيما يتعلق بالأوراق المالية.</p>

                    <p>تتولى الهيئة استقبال وإحالة الشكاوى في المنازعات بين أعضاء السوق وبين الأعضاء وعملائهم لشركة السوق المالية السعودية (تداول) لتسويتها وعند تعذر التسوية تعاد الشكوى للهيئة لإصدار إخطار لتمكين الشاكي من متابعة دعواه لدى اللجنة.</p>

                    <p><strong>كيف يتم&nbsp; تقديم شكوى رسمية إلى هيئة السوق المالية</strong></p>

                    <ul>
                        <li>
                        <p>من خلال رابط&nbsp;<a href="https://iipa.org.sa/?page_id=8833" rel="noopener" target="_blank">تقديم شكوى</a>.</p>
                        </li>
                        <li>
                        <p>إرسالها على العنوان البريدي للهيئة:&nbsp; ص.ب (87171) الرياض (11642).</p>
                        </li>
                        <li>
                        <p>ترسل إلى الفاكس رقم (00966114906470).</p>
                        </li>
                        <li>
                        <p>مقر هيئة السوق المالية طريق الملك فهد الدور الأرضي مكتب حماية المستثمر.</p>
                        </li>
                    </ul>

                    <p><strong>المستندات الواجب إرفاقها مع الشكوى</strong></p>

                    <ul>
                        <li>
                        <p>للأفراد صورة من بطاقة الهوية الوطنية للسعوديين ومواطني دول الخليج العربي، أو صورة من هوية مقيم لغير السعوديين، أو صورة من جواز السفر للمقيمين خارج المملكة، بالنسبة للمؤسسات والشركات صورة من السجل التجاري وأن تكون الشكوى موقعة من الشخص المفوض، (لن ينظر أو تستكمل إجراءات معالجة الشكوى في حالة عدم إرفاقها).</p>
                        </li>
                        <li>
                        <p>صورة من الوكالة الشرعية والهوية الوطنية للوكيل الشرعي.</p>

                        <p>صورة من المستندات المؤيدة للشكوى.</p>
                        </li>
                    </ul>
                    ',
                    'btn_name' => 'أضغط هنا لتقديم شكوى',
                ],
                'ar' => [
                    'meta_title' => 'كيف تقدم شكوى',
                    'meta_description' => 'كيف تقدم شكوى',
                    'meta_keywords' => 'كيف تقدم شكوى',
                    'name' => 'كيف تقدم شكوى',
                    'title' => 'كيف تقدم شكوى',
                    'brief' => 'كيف تقدم شكوى كيف تقدم شكوى',
                    'description' => '<p>تستقبل هيئة السوق المالية الشكاوى التي تقع في نطاق أحكام نظام السوق المالية ولوائحه التنفيذية، والنظر فيها ودراستها والتحقق من صحتها، والعمل على تسوية المنازعات التي تنشأ بين الأطراف المشاركة فيما يتعلق بالأوراق المالية.</p>

                    <p>تتولى الهيئة استقبال وإحالة الشكاوى في المنازعات بين أعضاء السوق وبين الأعضاء وعملائهم لشركة السوق المالية السعودية (تداول) لتسويتها وعند تعذر التسوية تعاد الشكوى للهيئة لإصدار إخطار لتمكين الشاكي من متابعة دعواه لدى اللجنة.</p>

                    <p><strong>كيف يتم&nbsp; تقديم شكوى رسمية إلى هيئة السوق المالية</strong></p>

                    <ul>
                        <li>
                        <p>من خلال رابط&nbsp;<a href="https://iipa.org.sa/?page_id=8833" rel="noopener" target="_blank">تقديم شكوى</a>.</p>
                        </li>
                        <li>
                        <p>إرسالها على العنوان البريدي للهيئة:&nbsp; ص.ب (87171) الرياض (11642).</p>
                        </li>
                        <li>
                        <p>ترسل إلى الفاكس رقم (00966114906470).</p>
                        </li>
                        <li>
                        <p>مقر هيئة السوق المالية طريق الملك فهد الدور الأرضي مكتب حماية المستثمر.</p>
                        </li>
                    </ul>

                    <p><strong>المستندات الواجب إرفاقها مع الشكوى</strong></p>

                    <ul>
                        <li>
                        <p>للأفراد صورة من بطاقة الهوية الوطنية للسعوديين ومواطني دول الخليج العربي، أو صورة من هوية مقيم لغير السعوديين، أو صورة من جواز السفر للمقيمين خارج المملكة، بالنسبة للمؤسسات والشركات صورة من السجل التجاري وأن تكون الشكوى موقعة من الشخص المفوض، (لن ينظر أو تستكمل إجراءات معالجة الشكوى في حالة عدم إرفاقها).</p>
                        </li>
                        <li>
                        <p>صورة من الوكالة الشرعية والهوية الوطنية للوكيل الشرعي.</p>

                        <p>صورة من المستندات المؤيدة للشكوى.</p>
                        </li>
                    </ul>
                    ',
                    'btn_name' => 'أضغط هنا لتقديم شكوى',
                ],
                'type' => 1,
                'btn_link' => '#',
                'photo' => 'bg-card.png'
            ],
            [
                'en' => [
                    'meta_title' => 'Lorem ipsum dolor sit amet.',
                    'meta_description' => 'Lorem ipsum dolor sit amet.',
                    'meta_keywords' => 'Lorem ipsum dolor sit amet.',
                    'name' => 'Lorem ipsum dolor sit amet.',
                    'title' => 'Lorem ipsum dolor sit',
                    'brief' => 'Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet.',
                    'description' => '<p>المستثمرين والمشاركين في السوق هم الصف الأول لحماية السوق المالية، فلا تتردد في مشاركتك في الحد من مخالفات السوق المالية من خلال تقديم بلاغات عن أي ممارسات قد تشكل مخالفات لنظام السوق المالية ولوائحه التنفيذية، وتقدر الهيئة الأمانة والمسؤولية والحرص والوطنية لكل من يبادر بالتقدم ببلاغ عن مخالفة بشكل مباشر من خلال قنوات الهيئة المتاحة.</p>

                    <p><strong>كيفية تقديم بلاغ عن مخالفة لدى هيئة السوق المالية:</strong></p>

                    <ul>
                        <li><a href="https://ibusiness.cma.org.sa/ar/IC/Pages/Reports.aspx">نظام حماية المستثمر.</a></li>
                        <li>تطبيق حماية المستثمر.</li>
                        <li>البريد الإلكتروني:&nbsp;<a href="mailto:Violation.Reports@cma.org.sa">Violation.Reports@cma.org.sa</a>.</li>
                        <li>العنوان البريدي للهيئة: &nbsp;ص.ب (87171) الرياض (11642).</li>
                        <li>الفاكس رقم (00966112797004) تحويلة (7066)، و رقم (00966112797003) تحويلة (7066).</li>
                        <li>مقر هيئة السوق المالية طريق الملك فهد الدور الأرضي مكتب حماية المستثمر .</li>
                    </ul>

                    <p><strong>يمكنك تقديم البلاغ بدون الافصاح عن هويتك، وعند الافصاح عن معلوماتك الشخصية فإن الهيئة تؤكد على أن جميع ما يقدم من قبل المبلغين على مستوى المعلومات والهوية&nbsp; يتم التعامل معها بكل سرية.</strong></p>
                    ',
                    'btn_name' => 'اضغط هنا لتقديم بلاغ عن مخالفة',
                ],
                'ar' => [
                    'meta_title' => 'كيف تقدم بلاغ عن مخالفة',
                    'meta_description' => 'كيف تقدم بلاغ عن مخالفة',
                    'meta_keywords' => 'كيف تقدم بلاغ عن مخالفة',
                    'name' => 'كيف تقدم بلاغ عن مخالفة',
                    'title' => 'كيف تقدم بلاغ عن مخالفة',
                    'brief' => 'كيف تقدم بلاغ عن مخالفة كيف تقدم بلاغ عن مخالفة',
                    'description' => '<p>المستثمرين والمشاركين في السوق هم الصف الأول لحماية السوق المالية، فلا تتردد في مشاركتك في الحد من مخالفات السوق المالية من خلال تقديم بلاغات عن أي ممارسات قد تشكل مخالفات لنظام السوق المالية ولوائحه التنفيذية، وتقدر الهيئة الأمانة والمسؤولية والحرص والوطنية لكل من يبادر بالتقدم ببلاغ عن مخالفة بشكل مباشر من خلال قنوات الهيئة المتاحة.</p>

                    <p><strong>كيفية تقديم بلاغ عن مخالفة لدى هيئة السوق المالية:</strong></p>

                    <ul>
                        <li><a href="https://ibusiness.cma.org.sa/ar/IC/Pages/Reports.aspx">نظام حماية المستثمر.</a></li>
                        <li>تطبيق حماية المستثمر.</li>
                        <li>البريد الإلكتروني:&nbsp;<a href="mailto:Violation.Reports@cma.org.sa">Violation.Reports@cma.org.sa</a>.</li>
                        <li>العنوان البريدي للهيئة: &nbsp;ص.ب (87171) الرياض (11642).</li>
                        <li>الفاكس رقم (00966112797004) تحويلة (7066)، و رقم (00966112797003) تحويلة (7066).</li>
                        <li>مقر هيئة السوق المالية طريق الملك فهد الدور الأرضي مكتب حماية المستثمر .</li>
                    </ul>

                    <p><strong>يمكنك تقديم البلاغ بدون الافصاح عن هويتك، وعند الافصاح عن معلوماتك الشخصية فإن الهيئة تؤكد على أن جميع ما يقدم من قبل المبلغين على مستوى المعلومات والهوية&nbsp; يتم التعامل معها بكل سرية.</strong></p>
                    ',
                    'btn_name' => 'اضغط هنا لتقديم بلاغ عن مخالفة',
                ],
                'type' => 1,
                'btn_link' => '#',
                'photo' => 'bg-card.png'
            ],
            [
                'en' => [
                    //     'meta_title' => 'Lorem ipsum dolor sit amet.',
                    //     'meta_description' => 'Lorem ipsum dolor sit amet.',
                    //     'meta_keywords' => 'Lorem ipsum dolor sit amet.',
                    //     'name' => 'Lorem ipsum dolor sit amet.',
                    'title' => 'Lorem ipsum dolor sit',
                    'brief' => 'Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet.',
                    //     'description' => 'Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet.',
                    //     'btn_name' => 'Lorem ipsum',
                ],
                'ar' => [
                    //     'meta_title' => 'دليل حماية المستثمرين',
                    //     'meta_description' => 'دليل حماية المستثمرين',
                    //     'meta_keywords' => 'دليل حماية المستثمرين',
                    //     'name' => 'دليل حماية المستثمرين',
                    'title' => 'دليل حماية المستثمرين',
                    'brief' => 'دليل حماية المستثمرين دليل حماية المستثمرين',
                    //     'description' => 'دليل حماية المستثمرين دليل حماية المستثمرين دليل حماية المستثمرين دليل حماية المستثمرين دليل حماية المستثمرين دليل حماية المستثمرين دليل حماية المستثمرين دليل حماية المستثمرين',
                    //     'btn_name' => 'Lorem ipsum',
                ],
                'type' => 2,
                'btn_link' => '#',
                'photo' => 'bg-card.png',
                'attachment_pdf' => 'file.pdf'
            ],
            [
                'en' => [
                    // 'meta_title' => 'Lorem ipsum dolor sit amet.',
                    // 'meta_description' => 'Lorem ipsum dolor sit amet.',
                    // 'meta_keywords' => 'Lorem ipsum dolor sit amet.',
                    // 'name' => 'Lorem ipsum dolor sit amet.',
                    'title' => 'Lorem ipsum dolor sit',
                    'brief' => 'Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet.',
                    // 'description' => 'Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet.',
                    // 'btn_name' => 'Lorem ipsum',
                ],
                'ar' => [
                    // 'meta_title' => 'وثيقة حقوق المستثمر',
                    // 'meta_description' => 'وثيقة حقوق المستثمر',
                    // 'meta_keywords' => 'وثيقة حقوق المستثمر',
                    // 'name' => 'وثيقة حقوق المستثمر',
                    'title' => 'وثيقة حقوق المستثمر',
                    'brief' => 'وثيقة حقوق المستثمر وثيقة حقوق المستثمر',
                    // 'description' => 'وثيقة حقوق المستثمر وثيقة حقوق المستثمر وثيقة حقوق المستثمر وثيقة حقوق المستثمر وثيقة حقوق المستثمر وثيقة حقوق المستثمر وثيقة حقوق المستثمر وثيقة حقوق المستثمر',
                    // 'btn_name' => 'Lorem ipsum',
                ],
                'type' => 2,
                'btn_link' => '#',
                'photo' => 'bg-card.png',
                'attachment_pdf' => 'file.pdf'
            ],

        ];

        $initiatives = [
            [
                'en' => [
                    'meta_title' => 'Lorem ipsum dolor sit amet.',
                    'meta_description' => 'Lorem ipsum dolor sit amet.',
                    'meta_keywords' => 'Lorem ipsum dolor sit amet.',
                    'name' => 'Lorem ipsum dolor sit amet.',
                    'title' => 'Lorem ipsum dolor sit',
                    'brief' => 'Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet.',
                    'strategic_goal' => 'Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet.',
                    'target_group' => 'Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet.',
                    'description' => 'Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet.',
                ],
                'ar' => [
                    'meta_title' => 'مبادرة واعي للاستثمار الآمن',
                    'meta_description' => 'مبادرة واعي للاستثمار الآمن',
                    'meta_keywords' => 'مبادرة واعي للاستثمار الآمن',
                    'name' => 'مبادرة واعي للاستثمار الآمن',
                    'title' => 'مبادرة واعي للاستثمار الآمن',
                    'brief' => 'مبادرة واعي للاستثمار الآمن مبادرة واعي للاستثمار الآمن',
                    'strategic_goal' => 'مبادرة واعي للاستثمار الآمن مبادرة واعي للاستثمار الآمن',
                    'target_group' => 'مبادرة واعي للاستثمار الآمن مبادرة واعي للاستثمار الآمن',
                    'description' => 'مبادرة واعي للاستثمار الآمن مبادرة واعي للاستثمار الآمن مبادرة واعي للاستثمار الآمن مبادرة واعي للاستثمار الآمن مبادرة واعي للاستثمار الآمن مبادرة واعي للاستثمار الآمن مبادرة واعي للاستثمار الآمن مبادرة واعي للاستثمار الآمن',
                ],
                'type' => 1,
                'photo' => 'bg-card.png'
            ],
            [
                'en' => [
                    'meta_title' => 'Lorem ipsum dolor sit amet.',
                    'meta_description' => 'Lorem ipsum dolor sit amet.',
                    'meta_keywords' => 'Lorem ipsum dolor sit amet.',
                    'name' => 'Lorem ipsum dolor sit amet.',
                    'title' => 'Lorem ipsum dolor sit',
                    'brief' => 'Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet.',
                    'strategic_goal' => 'Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet.',
                    'target_group' => 'Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet.',
                    'description' => 'Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet.',
                ],
                'ar' => [
                    'meta_title' => 'مبادرة مستشارك القانوني',
                    'meta_description' => 'مبادرة مستشارك القانوني',
                    'meta_keywords' => 'مبادرة مستشارك القانوني',
                    'name' => 'مبادرة مستشارك القانوني',
                    'title' => 'مبادرة مستشارك القانوني',
                    'brief' => 'مبادرة مستشارك القانوني مبادرة مستشارك القانوني',
                    'strategic_goal' => 'مبادرة مستشارك القانوني مبادرة مستشارك القانوني',
                    'target_group' => 'مبادرة مستشارك القانوني مبادرة مستشارك القانوني',
                    'description' => 'مبادرة مستشارك القانوني مبادرة مستشارك القانوني مبادرة مستشارك القانوني مبادرة مستشارك القانوني مبادرة مستشارك القانوني مبادرة مستشارك القانوني مبادرة مستشارك القانوني مبادرة مستشارك القانوني',
                ],
                'type' => 1,
                'photo' => 'bg-card.png'
            ],
            [
                'en' => [
                    'meta_title' => 'Lorem ipsum dolor sit amet.',
                    'meta_description' => 'Lorem ipsum dolor sit amet.',
                    'meta_keywords' => 'Lorem ipsum dolor sit amet.',
                    'name' => 'Lorem ipsum dolor sit amet.',
                    'title' => 'Lorem ipsum dolor sit',
                    'brief' => 'Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet.',
                    'strategic_goal' => 'Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet.',
                    'target_group' => 'Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet.',
                    'description' => 'Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet.',
                ],
                'ar' => [
                    'meta_title' => 'مبادرة المرصد السعودي للسوق المالية',
                    'meta_description' => 'مبادرة المرصد السعودي للسوق المالية',
                    'meta_keywords' => 'مبادرة المرصد السعودي للسوق المالية',
                    'name' => 'مبادرة المرصد السعودي للسوق المالية',
                    'title' => 'مبادرة المرصد السعودي للسوق المالية',
                    'brief' => 'مبادرة المرصد السعودي للسوق المالية مبادرة المرصد السعودي للسوق المالية',
                    'strategic_goal' => 'مبادرة المرصد السعودي للسوق المالية مبادرة المرصد السعودي للسوق المالية',
                    'target_group' => 'مبادرة المرصد السعودي للسوق المالية مبادرة المرصد السعودي للسوق المالية',
                    'description' => 'مبادرة المرصد السعودي للسوق المالية مبادرة المرصد السعودي للسوق المالية مبادرة المرصد السعودي للسوق المالية مبادرة المرصد السعودي للسوق المالية مبادرة المرصد السعودي للسوق المالية مبادرة المرصد السعودي للسوق المالية مبادرة المرصد السعودي للسوق المالية مبادرة المرصد السعودي للسوق المالية',
                ],
                'type' => 1,
                'photo' => 'bg-card.png'
            ],
            [
                'en' => [
                    'meta_title' => 'Lorem ipsum dolor sit amet.',
                    'meta_description' => 'Lorem ipsum dolor sit amet.',
                    'meta_keywords' => 'Lorem ipsum dolor sit amet.',
                    'name' => 'Lorem ipsum dolor sit amet.',
                    'title' => 'Lorem ipsum dolor sit',
                    'brief' => 'Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet.',
                    'strategic_goal' => 'Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet.',
                    'target_group' => 'Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet.',
                    'description' => 'Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet.',
                ],
                'ar' => [
                    'meta_title' => 'مبادرة مركز / كرسي للدراسات الاستراتيجية للسوق المالية السعودية',
                    'meta_description' => 'مبادرة مركز / كرسي للدراسات الاستراتيجية للسوق المالية السعودية',
                    'meta_keywords' => 'مبادرة مركز / كرسي للدراسات الاستراتيجية للسوق المالية السعودية',
                    'name' => 'مبادرة مركز / كرسي للدراسات الاستراتيجية للسوق المالية السعودية',
                    'title' => 'مبادرة مركز / كرسي للدراسات الاستراتيجية للسوق المالية السعودية',
                    'brief' => 'مبادرة مركز / كرسي للدراسات الاستراتيجية للسوق المالية السعودية مبادرة مركز / كرسي للدراسات الاستراتيجية للسوق المالية السعودية',
                    'strategic_goal' => 'مبادرة مركز / كرسي للدراسات الاستراتيجية للسوق المالية السعودية مبادرة مركز / كرسي للدراسات الاستراتيجية للسوق المالية السعودية',
                    'target_group' => 'مبادرة مركز / كرسي للدراسات الاستراتيجية للسوق المالية السعودية مبادرة مركز / كرسي للدراسات الاستراتيجية للسوق المالية السعودية',
                    'description' => 'مبادرة مركز / كرسي للدراسات الاستراتيجية للسوق المالية السعودية مبادرة مركز / كرسي للدراسات الاستراتيجية للسوق المالية السعودية مبادرة مركز / كرسي للدراسات الاستراتيجية للسوق المالية السعودية مبادرة مركز / كرسي للدراسات الاستراتيجية للسوق المالية السعودية مبادرة مركز / كرسي للدراسات الاستراتيجية للسوق المالية السعودية مبادرة مركز / كرسي للدراسات الاستراتيجية للسوق المالية السعودية مبادرة مركز / كرسي للدراسات الاستراتيجية للسوق المالية السعودية مبادرة مركز / كرسي للدراسات الاستراتيجية للسوق المالية السعودية',
                ],
                'type' => 1,
                'photo' => 'bg-card.png'
            ],
            [
                'en' => [
                    'meta_title' => 'Lorem ipsum dolor sit amet.',
                    'meta_description' => 'Lorem ipsum dolor sit amet.',
                    'meta_keywords' => 'Lorem ipsum dolor sit amet.',
                    'name' => 'Lorem ipsum dolor sit amet.',
                    'title' => 'Lorem ipsum dolor sit',
                    'brief' => 'Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet.',
                    'strategic_goal' => 'Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet.',
                    'target_group' => 'Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet.',
                    'description' => 'Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet.',
                ],
                'ar' => [
                    'meta_title' => 'مبادرة ديوانية المستثمرين الأفراد',
                    'meta_description' => 'مبادرة ديوانية المستثمرين الأفراد',
                    'meta_keywords' => 'مبادرة ديوانية المستثمرين الأفراد',
                    'name' => 'مبادرة ديوانية المستثمرين الأفراد',
                    'title' => 'مبادرة ديوانية المستثمرين الأفراد',
                    'brief' => 'مبادرة ديوانية المستثمرين الأفراد مبادرة ديوانية المستثمرين الأفراد',
                    'strategic_goal' => 'مبادرة ديوانية المستثمرين الأفراد مبادرة ديوانية المستثمرين الأفراد',
                    'target_group' => 'مبادرة ديوانية المستثمرين الأفراد مبادرة ديوانية المستثمرين الأفراد',
                    'description' => 'مبادرة ديوانية المستثمرين الأفراد مبادرة ديوانية المستثمرين الأفراد مبادرة ديوانية المستثمرين الأفراد مبادرة ديوانية المستثمرين الأفراد مبادرة ديوانية المستثمرين الأفراد مبادرة ديوانية المستثمرين الأفراد مبادرة ديوانية المستثمرين الأفراد مبادرة ديوانية المستثمرين الأفراد',
                ],
                'type' => 1,
                'photo' => 'bg-card.png'
            ],
            [
                'en' => [
                    'meta_title' => 'Lorem ipsum dolor sit amet.',
                    'meta_description' => 'Lorem ipsum dolor sit amet.',
                    'meta_keywords' => 'Lorem ipsum dolor sit amet.',
                    'name' => 'Lorem ipsum dolor sit amet.',
                    'title' => 'Lorem ipsum dolor sit',
                    'brief' => 'Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet.',
                    'strategic_goal' => 'Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet.',
                    'target_group' => 'Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet.',
                    'description' => 'Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet.',
                ],
                'ar' => [
                    'meta_title' => 'مبادرة مؤتمر ممارسات وقوانين السوق المالية السعودية',
                    'meta_description' => 'مبادرة مؤتمر ممارسات وقوانين السوق المالية السعودية',
                    'meta_keywords' => 'مبادرة مؤتمر ممارسات وقوانين السوق المالية السعودية',
                    'name' => 'مبادرة مؤتمر ممارسات وقوانين السوق المالية السعودية',
                    'title' => 'مبادرة مؤتمر ممارسات وقوانين السوق المالية السعودية',
                    'brief' => 'مبادرة مؤتمر ممارسات وقوانين السوق المالية السعودية مبادرة مؤتمر ممارسات وقوانين السوق المالية السعودية',
                    'strategic_goal' => 'مبادرة مؤتمر ممارسات وقوانين السوق المالية السعودية مبادرة مؤتمر ممارسات وقوانين السوق المالية السعودية',
                    'target_group' => 'مبادرة مؤتمر ممارسات وقوانين السوق المالية السعودية مبادرة مؤتمر ممارسات وقوانين السوق المالية السعودية',
                    'description' => 'مبادرة مؤتمر ممارسات وقوانين السوق المالية السعودية مبادرة مؤتمر ممارسات وقوانين السوق المالية السعودية مبادرة مؤتمر ممارسات وقوانين السوق المالية السعودية مبادرة مؤتمر ممارسات وقوانين السوق المالية السعودية مبادرة مؤتمر ممارسات وقوانين السوق المالية السعودية مبادرة مؤتمر ممارسات وقوانين السوق المالية السعودية مبادرة مؤتمر ممارسات وقوانين السوق المالية السعودية مبادرة مؤتمر ممارسات وقوانين السوق المالية السعودية',
                ],
                'type' => 1,
                'photo' => 'bg-card.png'
            ],
        ];

        $laws = [
            [
                'en' => [
                    'title' => 'نظام السوق المالي',
                    'description' => 'description'
                ],
                'ar' => [
                    'title' => 'نظام السوق المالي',
                    'description' => 'description'
                ],
                'attachment_pdf' => 'dummy.pdf',
                'type' => 2
            ],
            [
                'en' => [
                    'title' => 'دليل حماية المستثمر',
                    'description' => 'description'
                ],
                'ar' => [
                    'title' => 'دليل حماية المستثمر',
                    'description' => 'description'
                ],
                'attachment_pdf' => 'dummy.pdf',
                'type' => 2
            ],
            [
                'en' => [
                    'title' => 'وثيقة حماية المستثمر',
                    'description' => 'description'
                ],
                'ar' => [
                    'title' => 'وثيقة حماية المستثمر',
                    'description' => 'description'
                ],
                'attachment_pdf' => 'dummy.pdf',
                'type' => 2
            ],
            [
                'en' => [
                    'title' => 'قائمة المصطلحات المستخدمة',
                    'description' => 'description'
                ],
                'ar' => [
                    'title' => 'قائمة المصطلحات المستخدمة',
                    'description' => 'description'
                ],
                'attachment_pdf' => 'dummy.pdf',
                'type' => 2
            ],
            [
                'en' => [
                    'title' => 'لائحة اجراءات الفصل في منازعات الاوراق المالية',
                    'description' => 'description'
                ],
                'ar' => [
                    'title' => 'لائحة اجراءات الفصل في منازعات الاوراق المالية',
                    'description' => 'description'
                ],
                'attachment_pdf' => 'dummy.pdf',
                'type' => 2
            ],
            [
                'en' => [
                    'title' => 'لائحة سلوكيات السوق',
                    'description' => 'description'
                ],
                'ar' => [
                    'title' => 'لائحة سلوكيات السوق',
                    'description' => 'description'
                ],
                'attachment_pdf' => 'dummy.pdf',
                'type' => 2
            ],
            [
                'en' => [
                    'title' => 'التعاميم',
                    'description' => 'description'
                ],
                'ar' => [
                    'title' => 'التعاميم',
                    'description' => 'description'
                ],
                'attachment_pdf' => 'dummy.pdf',
                'type' => 1,
                'btn_link' => '#'
            ],
        ];

        $directors = [
            [
                'photo' => 'img-Administration.png',
                'name' => 'محمد أحمد الضبعان',
                'nickname' => 'سعادة المحامي الأستاذ',
                'job_title' => 'رئيس مجلس الإدارة'
            ],
            [
                'photo' => 'img-Administration.png',
                'name' => 'محمد أحمد الضبعان',
                'nickname' => 'سعادة المحامي الأستاذ',
                'job_title' => 'رئيس مجلس الإدارة'
            ],
            [
                'photo' => 'img-Administration.png',
                'name' => 'محمد أحمد الضبعان',
                'nickname' => 'سعادة المحامي الأستاذ',
                'job_title' => 'رئيس مجلس الإدارة'
            ],
            [
                'photo' => 'img-Administration.png',
                'name' => 'محمد أحمد الضبعان',
                'nickname' => 'سعادة المحامي الأستاذ',
                'job_title' => 'رئيس مجلس الإدارة'
            ],
            [
                'photo' => 'img-Administration.png',
                'name' => 'محمد أحمد الضبعان',
                'nickname' => 'سعادة المحامي الأستاذ',
                'job_title' => 'رئيس مجلس الإدارة'
            ],
            [
                'photo' => 'img-Administration.png',
                'name' => 'محمد أحمد الضبعان',
                'nickname' => 'سعادة المحامي الأستاذ',
                'job_title' => 'رئيس مجلس الإدارة'
            ],

        ];

        foreach ($pages as $page) {
            Page::create($page);
        }

        foreach ($paragraphs as $paragraph) {
            Paragraph::create($paragraph);
        }

        foreach ($partners as $partner) {
            Partner::create($partner);
        }

        foreach ($outreachs as $outreach) {
            Outreach::create($outreach);
        }

        foreach ($initiatives as $initiative) {
            Initiative::create($initiative);
        }

        foreach ($laws as $law) {
            Law::create($law);
        }

        foreach ($directors as $director) {
            Director::create($director);
        }
    }
}
